In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame([[1, 20, '서울'], [2, 25, '대전'],[3, 30, '부산'], [1, 20, '서울']],
                 index = ['홍길동', '사람 2', '사람 3', '사람 1'],
                 columns = ['순서', '나이', '도서'])

In [3]:
df

      순서  나이  도서
홍길동    1  20  서울
사람 2   2  25  대전
사람 3   3  30  부산
사람 1   1  20  서울

In [4]:
df2 = df

In [5]:
df2

      순서  나이  도서
홍길동    1  20  서울
사람 2   2  25  대전
사람 3   3  30  부산
사람 1   1  20  서울

In [6]:
df2.loc['사람 1', '순서'] = 4

In [7]:
df2

      순서  나이  도서
홍길동    1  20  서울
사람 2   2  25  대전
사람 3   3  30  부산
사람 1   4  20  서울

In [8]:
df # 데이터프레임에서 역시 원 데이터도 바꼈구만

      순서  나이  도서
홍길동    1  20  서울
사람 2   2  25  대전
사람 3   3  30  부산
사람 1   4  20  서울

In [10]:
df3 = df.copy()

In [11]:
df3

      순서  나이  도서
홍길동    1  20  서울
사람 2   2  25  대전
사람 3   3  30  부산
사람 1   4  20  서울

In [14]:
df3.loc['사람 1', '순서'] = 5

In [15]:
df3

       순서    나이   도서
홍길동   1.0  20.0   서울
사람 2  2.0  25.0   대전
사람 3  3.0  30.0   부산
사람 1  5.0  20.0   서울
사람1   5.0   NaN  NaN

In [16]:
df

      순서  나이  도서
홍길동    1  20  서울
사람 2   2  25  대전
사람 3   3  30  부산
사람 1   4  20  서울

In [17]:
hong = df.loc['홍길동']
hong

순서     1
나이    20
도서    서울
Name: 홍길동, dtype: object

In [18]:
type(hong)

pandas.core.series.Series

In [19]:
hong.shape

(3,)

In [20]:
gil = df.iloc[0]

In [21]:
gil

순서     1
나이    20
도서    서울
Name: 홍길동, dtype: object

In [22]:
type(gil)

pandas.core.series.Series

In [23]:
gil.shape

(3,)

In [24]:
df4 = df.loc[['홍길동', '사람 1']]

In [25]:
df4

      순서  나이  도서
홍길동    1  20  서울
사람 1   4  20  서울

In [26]:
type(df4)

pandas.core.frame.DataFrame

In [27]:
df5 = df.iloc[[0, 3]]

In [28]:
df5

      순서  나이  도서
홍길동    1  20  서울
사람 1   4  20  서울

In [29]:
type(df5)

pandas.core.frame.DataFrame

In [30]:
df6 = df.loc['홍길동':'사람 3']

In [31]:
df6

      순서  나이  도서
홍길동    1  20  서울
사람 2   2  25  대전
사람 3   3  30  부산

In [33]:
df7 = df.iloc[0 : 3]

In [34]:
df7

      순서  나이  도서
홍길동    1  20  서울
사람 2   2  25  대전
사람 3   3  30  부산

In [35]:
df

      순서  나이  도서
홍길동    1  20  서울
사람 2   2  25  대전
사람 3   3  30  부산
사람 1   4  20  서울

In [39]:
df8 = df[['나이']] #[[]] 데이터 프레임

In [40]:
df8

      나이
홍길동   20
사람 2  25
사람 3  30
사람 1  20

In [41]:
df9 = df['나이'] # series

In [42]:
df9

홍길동     20
사람 2    25
사람 3    30
사람 1    20
Name: 나이, dtype: int64

In [43]:
type(df9)

pandas.core.series.Series

In [44]:
type(df8)

pandas.core.frame.DataFrame

In [50]:
df10 = df[[ '나이','도서']]

In [51]:
df10

      나이  도서
홍길동   20  서울
사람 2  25  대전
사람 3  30  부산
사람 1  20  서울

In [52]:
df

      순서  나이  도서
홍길동    1  20  서울
사람 2   2  25  대전
사람 3   3  30  부산
사람 1   4  20  서울

In [54]:
df11 = df.loc[['홍길동', '사람 1'],['나이', '도서']]

In [55]:
df11

      나이  도서
홍길동   20  서울
사람 1  20  서울

In [56]:
df12 = df.iloc[[0, 3],[1, 2]]

In [57]:
df12

      나이  도서
홍길동   20  서울
사람 1  20  서울